// อัตราเวนคืนกรมธรรม์ ต่อเงินเอาประกันภัย 1,000 บาท
export const SURRENDER_RATES_PER_1000: { [year: number]: number } = {
    1: 211,
    2: 732,
    3: 1811,
    4: 2759,
    5: 3909,
    6: 4716,
    7: 4845,
    8: 4917,
    9: 5051,
    10: 5129,
    11: 5269,
    12: 5353,
    13: 5499,
    14: 5590,
    15: 5743,
    16: 5900, // ปีที่ 16 เงินคืน 590% ของทุน ไม่ใช่เวนคืน
  };
  
  // % เงินคืนเทียบกับทุนประกัน
  export const CASHBACK_RATES: { [year: number]: number } = {
    2: 0.02,
    4: 0.02,
    6: 0.06,
    8: 0.06,
    10: 0.06,
    12: 0.06,
    14: 0.06,
    16: 5.90, // 590%
  };
  
  // % เงินปันผล (กรณีเวนคืน) จากยอดคำนวณ
  export const SURRENDER_DIVIDEND_PERCENTAGES: { [year: number]: number } = {
    1: 0, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0,
    7: 0.10, 8: 0.20, 9: 0.30, 10: 0.40, 11: 0.50,
    12: 0.60, 13: 0.70, 14: 0.80, 15: 0.90, 16: 1.00,
  };
  
  // % เงินปันผล (กรณีเสียชีวิต) จากยอดคำนวณ
  export const DEATH_DIVIDEND_PERCENTAGES: { [year: number]: number } = {
     1: 0, 2: 1.00, 3: 1.00, 4: 1.00, 5: 1.00, 6: 1.00,
     7: 1.00, 8: 1.00, 9: 1.00, 10: 1.00, 11: 1.00,
     12: 1.00, 13: 1.00, 14: 1.00, 15: 1.00, 16: 1.00,
  };
  
  // % คุ้มครองชีวิต เทียบกับทุนประกัน
  export const DEATH_BENEFIT_RATES: { [year: number]: number } = {
    1: 1.01, 2: 2.02, 3: 3.15, 4:4.2, 5: 5.25, 6: 6.3, 7: 6.3, 8: 6.3, 
    9: 6.3, 10: 6.3, 11: 6.3, 12: 6.3, 13: 6.3, 14: 6.3, 15: 6.3, 16: 6.3,
};